app/controllers/proposal_viewer_controller.rb

SELECT * FROM "proposals" WHERE ("proposals".client_id = 1) LIMIT 1
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "proposal_sections" WHERE ("proposal_sections"."proposal_id" = '1') LIMIT 1
---
  def show
    proposal = Proposal.find(params[:id])
    client = proposal.client
    proposal_sections = []
    proposal.proposal_sections.each do |section|